export const universityData = [
  {
    id: 1,
    name: "جامعة الملك سعود",
    colleges: [
      "كلية الإدارة والأعمال",
      "كلية الهندسة",
      "كلية القانون",
      "كلية الطب",
    ],
  },
  {
    id: 2,
    name: "جامعة الملك فهد للبترول والمعادن",
    colleges: [
      "كلية الإدارة والأعمال",
      "كلية الهندسة",
      "كلية القانون",
      "كلية الطب",
    ],
  },
  {
    id: 3,
    name: "جامعة الملك عبدالعزيز",
    colleges: [
      "كلية الإدارة والأعمال",
      "كلية الهندسة",
      "كلية القانون",
      "كلية الطب",
    ],
  },
  {
    id: 4,
    name: "جامعة الإمام محمد بن سعود",
    colleges: [
      "كلية الإدارة والأعمال",
      "كلية الهندسة",
      "كلية القانون",
      "كلية الطب",
    ],
  },
  {
    id: 5,
    name: "جامعة الملك خالد",
    colleges: [
      "كلية الإدارة والأعمال",
      "كلية الهندسة",
      "كلية القانون",
      "كلية الطب",
    ],
  },
];

export const universities = universityData.map((uni) => uni.name);
