export const universityData = [
  {
    id: 1,
    name: "جامعة الملك سعود",
    colleges: [
      "كلية إدارة الأعمال",
      "كلية علوم الحاسب",
      "كلية الهندسة",
      "كلية الطب",
      "كلية الحقوق والعلوم السياسية",
      "كلية الآداب",
    ],
  },
  {
    id: 2,
    name: "جامعة الملك فهد للبترول والمعادن",
    colleges: [
      "كلية علوم الحاسب",
      "كلية الهندسة",
      "كلية العلوم",
      "كلية الإدارة الصناعية",
      "كلية الدراسات العامة",
    ],
  },
  {
    id: 3,
    name: "جامعة الإمام محمد بن سعود",
    colleges: [
      "كلية العلوم الاجتماعية",
      "كلية الشريعة",
      "كلية الاقتصاد والعلوم الإدارية",
      "كلية الإعلام والاتصال",
      "كلية علوم الحاسب والمعلومات",
    ],
  },
  {
    id: 4,
    name: "جامعة الأميرة نورة بنت عبد الرحمن",
    colleges: [
      "كلية الإدارة والأعمال",
      "كلية علوم الحاسب والمعلومات",
      "كلية التصاميم والفنون",
      "كلية اللغات",
      "كلية الصيدلة",
    ],
  },
  {
    id: 5,
    name: "جامعة الملك عبد العزيز",
    colleges: [
      "كلية الهندسة",
      "كلية الاقتصاد والإدارة",
      "كلية الآداب والعلوم الإنسانية",
      "كلية الحاسبات وتقنية المعلومات",
      "كلية الطب",
    ],
  },
];

export const universities = universityData.map((uni) => uni.name);
